# Python Challenge 

Description:

- You have data about an e-commerce site
- The 'sales_target' table contains the monthly target for each product category
- The 'orders' table contains records of each order
- The 'order_details' table contains details about the order such as purchased items, amounts, and price.

Solve the following data manipulation tasks

In [23]:
import pandas as pd

In [2]:
order_details = pd.read_csv('data/order_details_clean.csv')
orders = pd.read_csv('data/orders_clean.csv')
sales = pd.read_csv('data/sales_clean.csv')

In [3]:
order_details.head()

  order_id  amount  profit  quantity     category      sub-category
0  B-25601  1275.0 -1148.0         7    Furniture         Bookcases
1  B-25601    66.0   -12.0         5     Clothing             Stole
2  B-25601     8.0    -2.0         3     Clothing       Hankerchief
3  B-25601    80.0   -56.0         4  Electronics  Electronic Games
4  B-25602   168.0  -111.0         2  Electronics            Phones

In [4]:
orders.head()

  order_id  order_date customer_name           state       city  month    year
0  B-25601  2018-04-01        Bharat         Gujarat  Ahmedabad    4.0  2018.0
1  B-25602  2018-04-01         Pearl     Maharashtra       Pune    4.0  2018.0
2  B-25603  2018-04-03         Jahan  Madhya Pradesh     Bhopal    4.0  2018.0
3  B-25604  2018-04-03        Divsha       Rajasthan     Jaipur    4.0  2018.0
4  B-25605  2018-04-05       Kasheen     West Bengal    Kolkata    4.0  2018.0

In [5]:
sales.head()

  month_of_order   category    target  month  year
0     2018-04-01  Furniture  104000.0      4  2018
1     2018-05-01  Furniture  105000.0      5  2018
2     2018-06-01  Furniture  106000.0      6  2018
3     2018-07-01  Furniture  108000.0      7  2018
4     2018-08-01  Furniture  109000.0      8  2018

## One of the datasets contains duplicate rows, find and fix the issue before proceeding

## Which city has generated the highest total profits?

##  Find the top 3 best-selling sub-categories of products by the total quantity sold.